feat: architecture 2
